In [7]:
#Creating a series 

#creating a series 
import numpy as np
import pandas as pd
dict1 = {"Google": 450, "Amazon": 1200, "Yes Bank": 6004, "Flipkart": 1099, "Jabong": 892}
series1 = pd.Series(dict1)
series1

Google       450
Amazon      1200
Yes Bank    6004
Flipkart    1099
Jabong       892
dtype: int64

In [8]:
series1.index

Index(['Google', 'Amazon', 'Yes Bank', 'Flipkart', 'Jabong'], dtype='object')

In [9]:
series1.index.sort_values()

Index(['Amazon', 'Flipkart', 'Google', 'Jabong', 'Yes Bank'], dtype='object')

In [10]:
ex1={'b':33,'D':53,'a':23,'c':43}
series2 = pd.Series(ex1)
series2

b    33
D    53
a    23
c    43
dtype: int64

In [11]:
ex1={'b':33,'D':53,'a':23,'c':43}
series2 = pd.Series(ex1)
series2

b    33
D    53
a    23
c    43
dtype: int64

In [12]:
ex1={'b':033.00,'D':53.1,'a':23.5,'c':43.2}
series2 = pd.Series(ex1)
series2

b    33.0
D    53.1
a    23.5
c    43.2
dtype: float64

In [ ]:
st1 = {'INFY':567.12,'TCS':345.34,'Wipro': 564.45, 'HCL':45.15,'L&T':678.00}
ser2 = pd.Series(st1, index)

In [13]:
st1 = {'INFY':567.12,'TCS':345.34,'Wipro': 564.45, 'HCL':45.15,'L&T':678.00}
ser2 = pd.Series(st1, index = ['Wipro','TCS','HCL','L&T','INFY'])
ser2

Wipro    564.45
TCS      345.34
HCL       45.15
L&T      678.00
INFY     567.12
dtype: float64

In [14]:
ser2.index

Index(['Wipro', 'TCS', 'HCL', 'L&T', 'INFY'], dtype='object')

In [16]:
#Operations on series

ser2[0]=1000

In [17]:
ser2

Wipro    1000.00
TCS       345.34
HCL        45.15
L&T       678.00
INFY      567.12
dtype: float64

In [18]:
ser2['Genpact']

KeyError: 'Genpact'

In [19]:
##Slicing

ser2[:3]

Wipro    1000.00
TCS       345.34
HCL        45.15
dtype: float64

In [20]:
ser2.tail(2)

L&T     678.00
INFY    567.12
dtype: float64

In [21]:
#Logical operations

ex2=series1[series1>500]
ex2

Amazon      1200
Yes Bank    6004
Flipkart    1099
Jabong       892
dtype: int64

In [22]:
import numpy as np
np.mean(ser2)

527.122

In [23]:
ser2.mean()

527.122

In [27]:
##
arr1= np.array([1,2,3,4,5,6,7])
ser3=pd.Series(arr1)

In [28]:
ser3

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32

In [29]:
ser4 = ser3 * ser3
ser4

0     1
1     4
2     9
3    16
4    25
5    36
6    49
dtype: int32

In [30]:
np.sqrt(ser4)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
dtype: float64

In [31]:


ser4[1:]

1     4
2     9
3    16
4    25
5    36
6    49
dtype: int32

In [32]:


ser4[:-1]

0     1
1     4
2     9
3    16
4    25
5    36
dtype: int32

In [34]:
a=ser4[1:]
a

1     4
2     9
3    16
4    25
5    36
6    49
dtype: int32

In [35]:
b=ser4[:-1]
b

0     1
1     4
2     9
3    16
4    25
5    36
dtype: int32

In [36]:
series5=a+b
series5

0     NaN
1     8.0
2    18.0
3    32.0
4    50.0
5    72.0
6     NaN
dtype: float64

In [37]:
type(series5)

pandas.core.series.Series

In [57]:
#Dataframe Creation

series1 = {'INFY': pd.Series([1,2,3,4,5,6,7]), 'TCS': pd.Series([4,5,6,7,8,9,10]), 'Wipro': pd.Series([12,34,45,56,67,78,89])}
type(series1)

dict

In [58]:
series2=pd.DataFrame(series1)

In [59]:
series2

   INFY  TCS  Wipro
0     1    4     12
1     2    5     34
2     3    6     45
3     4    7     56
4     5    8     67
5     6    9     78
6     7   10     89

In [60]:
series2.index

RangeIndex(start=0, stop=7, step=1)

In [61]:
series2.columns

Index(['INFY', 'TCS', 'Wipro'], dtype='object')

In [62]:
series2.T

        0   1   2   3   4   5   6
INFY    1   2   3   4   5   6   7
TCS     4   5   6   7   8   9  10
Wipro  12  34  45  56  67  78  89

In [63]:
#Dictionary of lists creating dataframe

st1 = {'INFY':[22,33,44,55,66,77], 'TCS':[22,33,44,55,66,77], 'Wipro': [22,33,44,55,66,77], 'HCL': [22,33,44,55,66,77], 'L&T': [22,33,44,55,66,77]}
st1

{'INFY': [22, 33, 44, 55, 66, 77],
 'TCS': [22, 33, 44, 55, 66, 77],
 'Wipro': [22, 33, 44, 55, 66, 77],
 'HCL': [22, 33, 44, 55, 66, 77],
 'L&T': [22, 33, 44, 55, 66, 77]}

In [64]:
pd.DataFrame(st1)

   INFY  TCS  Wipro  HCL  L&T
0    22   22     22   22   22
1    33   33     33   33   33
2    44   44     44   44   44
3    55   55     55   55   55
4    66   66     66   66   66
5    77   77     77   77   77

In [67]:
##Using structured array

df3= np.zeros((4,), dtype=[('Name','U25'),('Gender','U10'),('Present/Absent','U15')])
df3

array([('', '', ''), ('', '', ''), ('', '', ''), ('', '', '')],
      dtype=[('Name', '<U25'), ('Gender', '<U10'), ('Present/Absent', '<U15')])

In [68]:
df3[:]= [('Ram','Male','Present'), ('Joseph','Male','Absent'),('Priya','Female','Absent'),('Swetha','Female','Present')]
df3

array([('Ram', 'Male', 'Present'), ('Joseph', 'Male', 'Absent'),
       ('Priya', 'Female', 'Absent'), ('Swetha', 'Female', 'Present')],
      dtype=[('Name', '<U25'), ('Gender', '<U10'), ('Present/Absent', '<U15')])

In [69]:
df4=pd.DataFrame(df3)
df4

     Name  Gender Present/Absent
0     Ram    Male        Present
1  Joseph    Male         Absent
2   Priya  Female         Absent
3  Swetha  Female        Present

In [70]:
#creating a data frame from a series
st1 = {'INFY':567.12,'TCS':345.34,'Wipro': 564.45, 'HCL':45.15,'L&T':678.00}
ser2 = pd.Series(st1, index = ['Wipro','TCS','HCL','L&T','INFY'])
ser2

Wipro    564.45
TCS      345.34
HCL       45.15
L&T      678.00
INFY     567.12
dtype: float64

In [71]:
df6 = pd.DataFrame(ser2)
df6

            0
Wipro  564.45
TCS    345.34
HCL     45.15
L&T    678.00
INFY   567.12

In [73]:
st1 = {'INFY':700.90,'TCS':600.99,'Wipro': 500.64, 'HCL':400.33,'L&T':678.00}
ser5 = pd.Series(st1, index = ['Wipro','TCS','HCL','L&T','INFY'])
ser5

Wipro    500.64
TCS      600.99
HCL      400.33
L&T      678.00
INFY     700.90
dtype: float64

In [74]:
df6=pd.DataFrame(ser2+ser5)
df6

             0
Wipro  1065.09
TCS     946.33
HCL     445.48
L&T    1356.00
INFY   1268.02

In [77]:
ser_fin = pd.concat([ser2,ser5], axis=1) #axis it concatenated rowwise
ser_fin

            0       1
Wipro  564.45  500.64
TCS    345.34  600.99
HCL     45.15  400.33
L&T    678.00  678.00
INFY   567.12  700.90

In [78]:
df7=pd.DataFrame(ser_fin)
df7

            0       1
Wipro  564.45  500.64
TCS    345.34  600.99
HCL     45.15  400.33
L&T    678.00  678.00
INFY   567.12  700.90

In [85]:
?pd.Series

In [86]:
df7.columns

RangeIndex(start=0, stop=2, step=1)

In [87]:
df7.columns = ['day1','day2']
df7

         day1    day2
Wipro  564.45  500.64
TCS    345.34  600.99
HCL     45.15  400.33
L&T    678.00  678.00
INFY   567.12  700.90

In [91]:
##operation on Dataframes

x1=df7['day1']   #only show column 1
x1

Wipro    564.45
TCS      345.34
HCL       45.15
L&T      678.00
INFY     567.12
Name: day1, dtype: float64

In [92]:
type(x1)

pandas.core.series.Series

In [96]:
df7[:2] #show indexes 0 and 1

         day1    day2
Wipro  564.45  500.64
TCS    345.34  600.99

In [97]:
df7['day1']['TCS'] = 1966 #renaming the column value with respective index value TCS with 1966.0
df7

          day1    day2
Wipro   564.45  500.64
TCS    1966.00  600.99
HCL      45.15  400.33
L&T     678.00  678.00
INFY    567.12  700.90

In [98]:
df7.insert(2,'day3',(500,400,300,200,100))
df7

          day1    day2  day3
Wipro   564.45  500.64   500
TCS    1966.00  600.99   400
HCL      45.15  400.33   300
L&T     678.00  678.00   200
INFY    567.12  700.90   100